{
  "name": "Guidepardy Board 1",
  "categories": [
    {
      "name": "DevOps",
      "tiles": [
        {
          "value": 100,
          "clue": "This practice involves frequently merging code changes into a shared repository to detect bugs early.",
          "answer": "Continuous Integration (CI)"
        },
        {
          "value": 200,
          "clue": "This containerization platform uses layered images and a YAML-based compose file to orchestrate multi-container apps.",
          "answer": "Docker"
        },
        {
          "value": 400,
          "clue": "This Kubernetes object ensures a specified number of pod replicas are always running.",
          "answer": "a ReplicaSet"
        },
        {
          "value": 800,
          "clue": "This deployment strategy routes a small percentage of traffic to the new version before a full rollout.",
          "answer": "a Canary deployment"
        },
        {
          "value": 1000,
          "clue": "This HashiCorp tool lets you define infrastructure as code using HCL and supports providers for AWS, Azure, and GCP.",
          "answer": "Terraform"
        }
      ]
    },
    {
      "name": "Movies",
      "tiles": [
        {
          "value": 100,
          "clue": "In this 1994 film, a mild-mannered man falsely convicted of murder befriends a fellow inmate and dreams of life on the Pacific coast of Mexico.",
          "answer": "The Shawshank Redemption"
        },
        {
          "value": 200,
          "clue": "This 1999 sci-fi film follows a hacker who discovers that his entire reality is a computer simulation controlled by machines.",
          "answer": "The Matrix"
        },
        {
          "value": 400,
          "clue": "In this 1993 Bill Murray comedy, a cynical TV weatherman relives the exact same day over and over in a small Pennsylvania town.",
          "answer": "Groundhog Day"
        },
        {
          "value": 800,
          "clue": "This 2010 Christopher Nolan thriller centers on a team that enters people's dreams to plant an idea deep in a target's subconscious.",
          "answer": "Inception"
        },
        {
          "value": 1000,
          "clue": "In this 1980 Kubrick horror film, a family becomes the winter caretakers of an isolated Colorado hotel with a dark history.",
          "answer": "The Shining"
        }
      ]
    },
    {
      "name": "GitHub Actions",
      "tiles": [
        {
          "value": 100,
          "clue": "This YAML key in a CI/CD pipeline file specifies the events that trigger the pipeline, such as 'push' or 'pull_request'.",
          "answer": "on"
        },
        {
          "value": 200,
          "clue": "These encrypted values are stored in a repository's settings and injected into pipelines at runtime using the syntax ${{ secrets.NAME }}.",
          "answer": "GitHub Secrets"
        },
        {
          "value": 400,
          "clue": "This type of CI/CD runner is hosted on your own infrastructure rather than a cloud provider's machines.",
          "answer": "a self-hosted runner"
        },
        {
          "value": 800,
          "clue": "This feature lets you extract a common pipeline configuration into a standalone file that other pipelines can call via 'workflow_call'.",
          "answer": "Reusable Workflows"
        },
        {
          "value": 1000,
          "clue": "This workflow strategy runs the same job multiple times with different configurations, commonly used for testing across Node versions or OS types.",
          "answer": "a Matrix strategy"
        }
      ]
    },
    {
      "name": "Cloud Resources",
      "tiles": [
        {
          "value": 100,
          "clue": "This AWS service provides scalable object storage, commonly used to host static websites, with buckets as its core organizing concept.",
          "answer": "Amazon S3"
        },
        {
          "value": 200,
          "clue": "This compute model runs your code in response to events without requiring you to provision or manage any underlying servers.",
          "answer": "serverless functions (Lambda / Azure Functions)"
        },
        {
          "value": 400,
          "clue": "This AWS service provides a fully managed control plane for running containerized workloads, with Azure offering a comparable service called AKS.",
          "answer": "Amazon EKS (Elastic Kubernetes Service)"
        },
        {
          "value": 800,
          "clue": "This type of cloud database is fully managed, scales automatically, and charges per request — DynamoDB on AWS or Cosmos DB on Azure.",
          "answer": "a serverless NoSQL database"
        },
        {
          "value": 1000,
          "clue": "This networking construct in both AWS and Azure provides an isolated virtual network where you can launch resources with private IP addresses.",
          "answer": "a Virtual Private Cloud (VPC) / Virtual Network (VNet)"
        }
      ]
    },
    {
      "name": "Wildcard",
      "tiles": [
        {
          "value": 100,
          "clue": "This gas giant is the largest planet in our solar system and has a storm larger than Earth that has lasted for centuries.",
          "answer": "Jupiter"
        },
        {
          "value": 200,
          "clue": "This ancient wonder of the world is the only one still standing today, located on the Giza plateau in Egypt.",
          "answer": "the Great Pyramid of Giza"
        },
        {
          "value": 400,
          "clue": "This element, with atomic number 79 and symbol Au, has been used as currency for thousands of years.",
          "answer": "Gold"
        },
        {
          "value": 800,
          "clue": "In 1969, this Apollo mission made Neil Armstrong and Buzz Aldrin the first humans to walk on the Moon.",
          "answer": "Apollo 11"
        },
        {
          "value": 1000,
          "clue": "This board game, originally called 'The Landlord's Game,' was patented in 1904 and is now owned by Hasbro.",
          "answer": "Monopoly"
        }
      ]
    }
  ]
}
